{
  "layout": "उत्पाद",
  "head": {
    "title": "Java रिडक्शन API | PDF Word Excel छवि से संवेदनशील डेटा छिपाएं",
    "description": "Java डॉक्यूमेंट रिडक्शन API - विभिन्न प्रकार के रिडक्शन के माध्यम से PDF, Word, Excel, PowerPoint प्रस्तुतियों और रैस्टर छवियों से व्यक्तिगत डेटा छिपाएं।"
  },
  "header": {
    "title": "Java API के माध्यम से निजी जानकारी को फिर से बनाएँ",
    "description": "Java रिडक्शन API का उपयोग करके दस्तावेज़ों, वर्कशीट्स, प्रस्तुतियों, PDF और रैस्टर इमेज फ़ाइलों से व्यक्तिगत जानकारी और मेटाडेटा को बाहर निकालें या छिपाएं।"
  },
  "submenu": {
    "content_middle": {
      "button_text_1": "संक्षिप्त विवरण",
      "button_text_2": "फीचर्स",
      "button_text_3": "सहायता",
      "button_text_4": "लाइव डेमो",
      "button_text_5": "मूल्य निर्धारण"
    }
  },
  "tabs": {
    "overview": "GroupDocs.Redaction for Java API डेवलपर्स को Microsoft Word, Excel, PowerPoint, PDF और छवियों जैसे लोकप्रिय फ़ाइल स्वरूपों से संवेदनशील डेटा निकालने की सुविधा देता है ताकि इसका उपयोग और वितरण किया जा सके, लेकिन फिर भी गोपनीय जानकारी की सुरक्षा भी की जा सके। रिडक्शन लाइब्रेरी टेक्स्ट, मेटाडेटा और एनोटेशन रिडक्शन प्रकारों के माध्यम से सामाजिक सुरक्षा नंबर, चिकित्सा जानकारी, वित्तीय, मालिकाना, कानूनी या यहां तक कि व्यापार विवरण सहित किसी भी प्रकार की वर्गीकृत जानकारी को संपादित करने के लिए एक एकल प्रारूप-स्वतंत्र इंटरफ़ेस प्रदान करती है। यह आपको दस्तावेज़ को उसके मूल प्रारूप में सहेजने और मूल पृष्ठों की रेखापुंज छवियों के साथ एक स्वच्छ PDF दस्तावेज़ बनाने की अनुमति देता है।",
    "one": {
      "description": "{{ProductName}} के लिए GroupDocs.Redaction का अवलोकन निम्नलिखित है:",
      "content": {
        "title": "संक्षिप्त विवरण",
        "step_1": "टेक्स्ट रिडक्ट करें",
        "step_2": "मेटाडेटा को फिर से तैयार करें",
        "step_3": "एनोटेशन को फिर से तैयार करें",
        "step_4": "टेबुलर दस्तावेज़ को फिर से तैयार करें",
        "step_5": "संरक्षित फ़ाइलों को फिर से बनाएँ",
        "step_6": "अनुकूलन"
      }
    },
    "two": {
      "description": "{{ProductName}} के लिए GroupDocs.Redaction निम्नलिखित [दस्तावेज़ फ़ाइल स्वरूपों] का समर्थन करता है (https://docs.groupdocs.com/redaction//supported-document-formats/{{ProductCode}}):",
      "content": {
        "title": "टेक्स्ट, मेटाडेटा और टिप्पणियां संपादित करें",
        "step_1": "**Word**: DOC, DOCX, DOT, ODT, DOTX, DOCM, DOTM, RTF",
        "step_2": "**Excel**: XLS, XLSX, XLT, XLTX, XLSM, XLTM, सीएसवी",
        "step_3": "**PowerPoint**: PPT, PPTX, PPS, PPSX, POTX, PPTM, PPSM, POTM",
        "step_4": "**फिक्स्ड लेआउट**: PDF",
        "step_5": "**रैस्टर इमेजेज**: JPG, BMP, PNG, GIF, TIFF"
      }
    },
    "three": {
      "description": "{{ProductName}} के लिए GroupDocs.Redaction निम्नलिखित ऑपरेटिंग सिस्टम, फ़्रेमवर्क और पैकेज मैनेजरों का समर्थन करता है:",
      "content": {
        "left": {
          "row1": {
            "title": "ऑपरेटिंग सिस्टम",
            "data": "* माइक्रोसॉफ्ट Windows Desktop
                * माइक्रोसॉफ्ट Windows Server
                * Linux
                * Mac ओएस"
          },
          "row2": {
            "title": "समर्थित फ़्रेमवर्क",
            "data": "* Java 7 (1.7) और इसके बाद के संस्करण"
          }
        },
        "right": {
          "row1": {
            "icon": "फास फा-कॉग्स",
            "title": "विकास का वातावरण",
            "data": "* नेटबीन्स
                * इंटेलीज आइडिया
                * ग्रहण"
          },
          "row2": {
            "icon": "फास फा-टूल्स",
            "title": "ऑटोमेशन टूल बनाएं",
            "data": "* मेवेन"
          }
        }
      }
    }
  },
  "features": {
    "title": "{{ProductName}} सुविधाओं के लिए GroupDocs.Redaction",
    "feature1": "खोज स्ट्रिंग के सटीक मिलान खोजें और संपादित करें",
    "feature2": "रिडक्शन प्रक्रिया को नियंत्रित करें और विशिष्ट मैचों को छोड़ दें",
    "feature3": "नियमित अभिव्यक्तियों का उपयोग करके खोजें और फिर से बनाएं",
    "feature4": "कार्यालय प्रारूपों और PDF के लिए अंतर्निहित समर्थन",
    "feature5": "मेटाडेटा मिटाएं या मेटाडेटा मानों को संशोधित करें",
    "feature6": "रिडक्शन को विशिष्ट वर्कशीट और कॉलम तक सीमित करें",
    "feature7": "एनोटेशन हटाएं या उनके टेक्स्ट को संपादित करें",
    "feature8": "टेक्स्टुअल (छूट कोड) या ग्राफिक (रंगीन आयताकार) रिडक्शन का उपयोग करें",
    "feature9": "दस्तावेज़ को उसके मूल प्रारूप में या मूल पृष्ठों की रेखापुंज छवियों के साथ PDF के रूप में सहेजें",
    "feature10": "रैस्टर इमेज फॉर्मेट और इमेज रीजन रिडक्शन के लिए सहायता",
    "feature11": "कस्टम रिडक्शन और फॉर्मेट को लागू करने के लिए इंटीग्रेशन इंटरफेस",
    "feature12": "छवि फ़ाइलों से EXIF मेटाडेटा संपादित करें या निकालें",
    "feature13": "PDF, Word और प्रस्तुति दस्तावेज़ों के अंदर एम्बेडेड छवियों को फिर से बनाएं"
  },
  "more_features": {
    "title": "अपने वर्गीकृत डेटा को संशोधित करके गोपनीयता सुनिश्चित करें",
    "content": "{{ProductFullName}} लाइब्रेरी डेवलपर्स को विभिन्न प्रकार के रिडक्शन का उपयोग करके समर्थित दस्तावेज़ों से टेक्स्ट और छवियों को फिर से बनाने का अधिकार देती है। हमारे Redaction API का उपयोग करना सरल और सीधा है।",
    "example": {
      "description": "निम्न कोड उदाहरण Microsoft Excel स्प्रेडशीट जैसे टैब्यूलर दस्तावेज़ का उपयोग करता है, जहां रिडक्शन का दायरा किसी विशिष्ट वर्कशीट और/या कॉलम तक सीमित किया जा सकता है। यह वर्कशीट “ग्राहक” पर ईमेल के साथ दूसरे कॉलम को फिर से बनाने के लिए फ़िल्टर का उपयोग करता है, जिससे दस्तावेज़ में अन्य सभी ईमेल अछूते रह जाते हैं।",
      "comment_init": "Redactor वर्ग का एक उदाहरण बनाएं",
      "comment_apply": "रिडक्शन लागू करें"
    }
  },
  "solutions": "GroupDocs.Redaction अन्य लोकप्रिय विकास परिवेशों के लिए दस्तावेज़ देखने वाले API प्रदान करता है"
}