{
  "layout": "product",
  "head": {
    "title": "API редактирования C# .NET | Скрыть личный текст из изображений PDF Word Excel",
    "description": "API редактирования документов для .NET. Редактируйте, скрывайте или удаляйте конфиденциальное содержимое из PDF, Microsoft Word, Excel, презентаций и растровых изображений."
  },
  "header": {
    "title": "Защита секретных данных с помощью Redaction API",
    "description": "Редактировать, скрывать или удалять конфиденциальное содержимое и метаданные из документов, листов, презентаций, файлов PDF и растровых изображений с помощью .NET API."
  },
  "submenu": {
    "content_middle": {
      "button_text_1": "Обзор",
      "button_text_2": "Функции",
      "button_text_3": "Поддержка",
      "button_text_4": "Live Demo",
      "button_text_5": "Pricing"
    }
  },
  "tabs": {
    "overview": "GroupDocs.Redaction для .NET — это библиотека API, которая помогает удалять конфиденциальные и секретные данные из файлов различных форматов, таких как Microsoft Word, Excel, PowerPoint и PDF. Единый независимый от формата интерфейс нашего Redaction API поддерживает редактирование различных типов, например редактирование текста, редактирование метаданных, редактирование аннотаций и редактирование табличных документов. GroupDocs.Redaction for .NET API также позволяет редактировать файлы, защищенные паролем. Вы можете сохранить документ в исходном формате, а также создать очищенный PDF-документ с растровыми изображениями исходных страниц.",
    "one" : {
      "description": "Ниже приведен обзор GroupDocs.Redaction для {{ProductName}}:",
      "content": {
        "title": "Обзор",
        "step_1": "Редактировать текст",
        "step_2": "Редактировать метаданные",
        "step_3": "Редактировать аннотацию",
        "step_4": "Редактировать табличный документ",
        "step_5": "Редактировать защищенные файлы",
        "step_6": "Настройка"
      }
    },
    "two" : {
      "description": "GroupDocs.Redaction для .NET поддерживает следующие [форматы файлов документов](https://docs.groupdocs.com/redaction/net/supported-document-formats/):",
      "content": {
        "title": "Редактировать текст, Metadata & Comments",
        "step_1": "**Word**: DOC, DOCX, DOT, ODT, DOTX, DOCM, DOTM, RTF",
        "step_2": "**Excel**: XLS, XLSX, XLT, XLTX, XLSM, XLTM, CSV",
        "step_3": "**PowerPoint**: PPT, PPTX, PPS, PPSX, POTX, PPTM, PPSM, POTM",
        "step_4": "**Фиксированный макет**: PDF",
        "step_5": "**Растровые изображения**: JPG, BMP, PNG, GIF, TIFF"
      }
    },
    "three" : {
      "description": "GroupDocs.Redaction for .NET поддерживает следующие Операционные системы & Менеджер пакетов:",
      "content": {
        "left": {
          "row1": {
            "title": "Операционные системы",
            "data": "* Windows Desktop
                * Windows Server
                * Windows Azure
                * Linux",
          },
          "row2": {
            "title": "Поддерживаемые платформы",
            "data": "* .NET Framework 2.0 или выше
                * .NET Standard 2.0
                * .NET Core 2.0"
          }
        },
        "right": {
          "row1": {
            "icon": "fas fa-box",
            "title": "Менеджер пакетов",
            "data": "* NuGet",
          },
          "row2": {
            "icon": "fas fa-tools",
            "title": "Среды разработки",
            "data": "* Microsoft Visual Studio
                * Xamarin.Android
                * Xamarin.IOS
                * Xamarin.Mac
                * MonoDevelop"
          }
        }
      }
    }
  },
  "features": {
    "title": "Функции GroupDocs.Redaction for {{ProductName}}",
    "feature1": "Выполнять поиск с учетом регистра для точного редактирования фразы",
    "feature2": "Используйте цветовую рамку, чтобы скрыть отредактированный текст вместо замены строки",
    "feature3": "Найдите и отредактируйте любой текст, используя поиск по регулярным выражениям",
    "feature4": "Отфильтровать всю или любую комбинацию секретной информации метаданных документа",
    "feature5": "Быстрое удаление полной информации метаданных определенного документа",
    "feature6": "Установите область редактирования для определенного рабочего листа и/или столбца в Excel.",
    "feature7": "Удалить все или определенные комментарии и другие аннотации из документа",
    "feature8": "Поиск и удаление конфиденциальных данных из текста аннотации",
    "feature9": "Возможность работать с собственными форматами и редакциями",
    "feature10": "Поддержка форматов растровых изображений и редактирования областей изображения.",
    "feature11": "Укажите набор правил редактирования (политики) в файле XML",
    "feature12": "Укажите диапазон страниц и уровень соответствия PDF при преобразовании в PDF",
    "feature13": "Edit or Delete Метаданные EXIF from Image Files",
    "feature14": "Редактируйте встроенные изображения в документах PDF, Word и презентациях",
    "feature15": "Сохранение политики редактирования в виде XML-файла"
  },
  "more_features": {
    "title": "Редактируйте свои секретные данные с легкостью и контролем",
    "content": "GroupDocs.Redaction для .NET API предоставляет вам полный контроль над тем, как вы хотите скрыть или удалить важную секретную информацию из поддерживаемого документа. Использовать наш Redaction API довольно просто и понятно.",
    "example": {
      "description": "В следующем примере мы загружаем поддерживаемый документ, редактируем любой текст, сопоставляя \"2 цифры, пробел или ничего, 2 цифры, снова пробел и 6 цифр\" (например, 12 34 567890) с синим полем, используя C#. Как только это будет сделано, он сохранит документ в исходном формате, переименовав его с добавленным суффиксом \"_Redacted\":",
      "comment_init": "Создать экземпляр класса Redactor",
      "comment_apply": "Применить редактирование"
    }
  },
  "solutions": "GroupDocs.Redaction предлагает API для просмотра документов для других популярных сред разработки."
}