{
  "layout": "продукт",
  "head": {
    "title": "C# .NET API редагування | Приховати приватний текст із PDF Word Excel зображень",
    "description": "API редагування документів для .NET. Редагувати, приховувати або видаляти конфіденційні матеріали з PDF, Microsoft Word, Excel, презентацій та растрових зображень."
  },
  "header": {
    "title": "Захист класифікованих даних за допомогою API Redaction",
    "description": "Редагування, приховування або видалення конфіденційних вмісту та метаданих з документів, робочих аркушів, презентацій, PDF та файлів растрових зображень за допомогою .NET API."
  },
  "submenu": {
    "content_middle": {
      "button_text_1": "Огляд",
      "button_text_2": "Особливості",
      "button_text_3": "Підтримка",
      "button_text_4": "Жива демонстрація",
      "button_text_5": "Ціноутворення"
    }
  },
  "tabs": {
    "overview": "GroupDocs.Redaction for .NET - це бібліотека API, яка допомагає видалити конфіденційні та класифіковані дані з різних форматів файлів, таких як Microsoft Word, Excel, PowerPoint та PDF. Єдиний інтерфейс нашого Redaction API підтримує редагування різних типів, наприклад, редагування тексту, редагування метаданих, редагування анотацій та редагування табличного документа. GroupDocs.Redaction for .NET API також дозволяє редагувати захищені паролем файли. Ви можете зберегти документ у вихідному форматі, а також створити дезінфікований документ PDF з растровими зображеннями оригінальних сторінок.",
    "one": {
      "description": "Нижче наведено огляд GroupDocs.Redaction для {{ProductName}}:",
      "content": {
        "title": "Огляд",
        "step_1": "Редагувати текст",
        "step_2": "Редагувати метадані",
        "step_3": "Редагувати анотацію",
        "step_4": "Редагувати табличний документ",
        "step_5": "Редагувати захищені файли",
        "step_6": "Налаштування"
      }
    },
    "two": {
      "description": "GroupDocs.Redaction для {{ProductName}} підтримує наступні [формати файлів документів](https://docs.groupdocs.com/redaction//supported-document-formats/{{ProductCode}}):",
      "content": {
        "title": "Редагування тексту, метаданих та коментарів",
        "step_1": "**Word**: DOC, DOCX, DOT, ODT, DOTX, DOCM, DOTM, RTF",
        "step_2": "**Excel**: XLS, XLSX, XLT, XLTX, XLSM, XLTM, CSV",
        "step_3": "**PowerPoint**: PPT, PPTX, PPS, PPSX, POTX, PPTM, PPSM, POTM",
        "step_4": "**Фіксований макет**: PDF",
        "step_5": "**Растрові зображення**: JPG, BMP, PNG, GIF, TIFF"
      }
    },
    "three": {
      "description": "GroupDocs.Redaction для {{ProductName}} підтримує наступні операційні системи, фреймворки та менеджери пакетів:",
      "content": {
        "left": {
          "row1": {
            "title": "Операційні системи",
            "data": "* Windows Desktop
                * Windows Server
                * Windows Azure
                * Linux"
          },
          "row2": {
            "title": "Підтримувані рамки",
            "data": "* .NET Framework 2.0 або вище
                * .NET Standard 2.0
                * .NET Core 2.0"
          }
        },
        "right": {
          "row1": {
            "icon": "швидкий фасок-бокс",
            "title": "Менеджер пакетів",
            "data": "* NuGet"
          },
          "row2": {
            "icon": "швидкі вентилятори",
            "title": "Середовища розробки",
            "data": "* Microsoft Visual Studio
                * Xamarin.Android
                * Xamarin.IOS
                * Xamarin.Mac
                * MonoDevelop"
          }
        }
      }
    }
  },
  "features": {
    "title": "GroupDocs.Redaction для {{ProductName}} Особливості",
    "feature1": "Виконайте пошук з урахуванням регістру для точного редагування фрази",
    "feature2": "Використовуйте кольорове поле, щоб приховати відредагований текст замість заміни рядка",
    "feature3": "Знайдіть і відредагувати будь-який текст за допомогою пошуку регулярних виразів",
    "feature4": "Фільтрувати всю або будь-яку комбінацію класифікованої інформації метаданих документа",
    "feature5": "Швидко видаліть повну інформацію про метадані певного документа",
    "feature6": "Встановіть область редагування для певного аркуша та/або стовпця в Excel",
    "feature7": "Видаліть усі або конкретні коментарі та інші анотації з документа",
    "feature8": "Пошук і видалення конфіденційних даних з тексту анотації",
    "feature9": "Можливість роботи з власними форматами та редагованими",
    "feature10": "Підтримка форматів растрових зображень та редагування областей зображення",
    "feature11": "Вкажіть набір правил редагування (політики) у файлі XML",
    "feature12": "Вкажіть діапазон сторінок та рівень відповідності PDF під час перетворення на PDF",
    "feature13": "Редагування або видалення метаданих EXIF з файлів зображень",
    "feature14": "Редагувати вбудовані зображення всередині PDF, Word та презентаційних документів",
    "feature15": "Збереження політики редагування як XML-файлу"
  },
  "more_features": {
    "title": "Редагувати секретні дані з легкістю та контролем",
    "content": "{{ProductFullName}} API надає вам повний контроль над тим, як ви хочете приховати або стерти важливу секретну інформацію з підтримуваного документа. Використовувати наш Redaction API досить просто і просто.",
    "example": {
      "description": "У наступному прикладі ми завантажуємо підтримуваний документ, редаговуємо будь-який текст, відповідний «2 цифри, пробіл або нічого, 2 цифри, знову пробіл і 6 цифр» (наприклад, 12 34 567890) із полем синього кольору за допомогою {{ProgLang}}. Після цього він зберігає документ у вихідному форматі, перейменуючи його з доданим суфіксом «Відредаговано»:",
      "comment_init": "Створіть екземпляр класу Redactor",
      "comment_apply": "Застосувати редагування"
    }
  },
  "solutions": "GroupDocs.Redaction пропонує API для перегляду документів для інших популярних середовищ розробки"
}