{
  "layout": "продукт",
  "head": {
    "title": "Java API редагування | Приховати конфіденційні дані з PDF Word Excel зображення",
    "description": "Java API редагування документів - Приховати особисті дані з PDF, Word, Excel, Excel, PowerPoint, PowerPoint та растрових зображень за допомогою різних типів редагування."
  },
  "header": {
    "title": "Редагувати приватну інформацію через Java API",
    "description": "Виключіть або сховайте особисту інформацію та метадані з документів, робочих аркушів, презентацій, PDF та файлів растрових зображень за допомогою API редагування Java."
  },
  "submenu": {
    "content_middle": {
      "button_text_1": "Огляд",
      "button_text_2": "Особливості",
      "button_text_3": "Підтримка",
      "button_text_4": "Жива демонстрація",
      "button_text_5": "Ціноутворення"
    }
  },
  "tabs": {
    "overview": "GroupDocs.Redaction for Java API дозволяє розробникам видаляти конфіденційні дані з популярних форматів файлів, таких як Microsoft Word, Excel, Excel, PowerPoint, PDF та зображення, щоб їх можна було використовувати та розповсюджувати, але при цьому захищати конфіденційну інформацію. Бібліотека редагування пропонує єдиний незалежний від формату інтерфейс для редагування будь-якого типу секретної інформації, включаючи номери соціального страхування, медичну інформацію, фінансову, власну, юридичну або навіть торгову інформацію за допомогою тексту, метаданих та типів редагування анотацій. Це дозволяє зберегти документ у вихідному форматі та створити дезінфікований PDF документ з растровими зображеннями оригінальних сторінок.",
    "one": {
      "description": "Нижче наведено огляд GroupDocs.Redaction для {{ProductName}}:",
      "content": {
        "title": "Огляд",
        "step_1": "Редагувати текст",
        "step_2": "Редагувати метадані",
        "step_3": "Редагувати анотацію",
        "step_4": "Редагувати табличний документ",
        "step_5": "Редагувати захищені файли",
        "step_6": "Налаштування"
      }
    },
    "two": {
      "description": "GroupDocs.Redaction для {{ProductName}} підтримує наступні [формати файлів документів](https://docs.groupdocs.com/redaction//supported-document-formats/{{ProductCode}}):",
      "content": {
        "title": "Редагування тексту, метаданих та коментарів",
        "step_1": "**Word**: DOC, DOCX, DOT, ODT, DOTX, DOCM, DOTM, RTF",
        "step_2": "**Excel**: XLS, XLSX, XLT, XLTX, XLSM, XLTM, CSV",
        "step_3": "**PowerPoint**: PPT, PPTX, PPS, PPSX, POTX, PPTM, PPSM, POTM",
        "step_4": "**Фіксований макет**: PDF",
        "step_5": "**Растрові зображення**: JPG, BMP, PNG, GIF, TIFF"
      }
    },
    "three": {
      "description": "GroupDocs.Redaction для {{ProductName}} підтримує наступні операційні системи, фреймворки та менеджери пакетів:",
      "content": {
        "left": {
          "row1": {
            "title": "Операційні системи",
            "data": "* Майкрософт Windows Desktop
                * Майкрософт Windows Server
                * Linux
                * Mac ОС"
          },
          "row2": {
            "title": "Підтримувані рамки",
            "data": "* Java 7 (1.7) і вище"
          }
        },
        "right": {
          "row1": {
            "icon": "швидкі фаст-коги",
            "title": "Середовища розробки",
            "data": "* NetBeans
                * Інтелектуальна ІДЕЯ
                * Затемнення"
          },
          "row2": {
            "icon": "швидкі вентилятори",
            "title": "Інструмент автоматизації побудови",
            "data": "* Мавен"
          }
        }
      }
    }
  },
  "features": {
    "title": "GroupDocs.Redaction для {{ProductName}} Особливості",
    "feature1": "Пошук і редагування точних збігів пошукового рядка",
    "feature2": "Контролюйте процес редагування та пропускайте конкретні збіги",
    "feature3": "Знайдіть і відредагувати за допомогою регулярних виразів",
    "feature4": "Вбудована підтримка офісних форматів і PDF",
    "feature5": "Видалення метаданих або редагування значень метаданих",
    "feature6": "Обмежте редагування конкретними аркушами та стовпцями",
    "feature7": "Видаліть анотації або відредагувати їх тексти",
    "feature8": "Використовуйте текстові (коди звільнення) або графічні (кольорові прямокутники) редагування",
    "feature9": "Збережіть документ у вихідному форматі або як PDF з растровими зображеннями оригінальних сторінок",
    "feature10": "Підтримка форматів растрових зображень та редагування областей зображення",
    "feature11": "Інтеграційний інтерфейс для реалізації користувальницького редагування та форматів",
    "feature12": "Редагування або видалення метаданих EXIF з файлів зображень",
    "feature13": "Редагувати вбудовані зображення всередині PDF, Word та презентаційних документів"
  },
  "more_features": {
    "title": "Забезпечте конфіденційність шляхом редагування ваших секретних даних",
    "content": "{{ProductFullName}} бібліотека дає можливість розробникам редагувати текст і зображення з підтримуваних документів, використовуючи різні типи редагування. Використовувати наш API Redaction просто і просто.",
    "example": {
      "description": "У наступному прикладі коду використовується табличний документ, такий як електронна таблиця Microsoft Excel, де обсяг редагування може бути обмежений певним робочим аркушем та/або стовпцем. Він використовує фільтри для редагування другого стовпця з електронними листами на аркуші «Клієнти», залишаючи всі інші електронні листи недоторканими в документі.",
      "comment_init": "Створіть екземпляр класу Redactor",
      "comment_apply": "Застосувати редагування"
    }
  },
  "solutions": "GroupDocs.Redaction пропонує API для перегляду документів для інших популярних середовищ розробки"
}